sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny85_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
attiny85_diy.menu.boot.optiboot.upload.protocol=arduino
attiny85_diy.menu.boot.optiboot.upload.maximum_size=7610
attiny85_diy.menu.boot.optiboot.bootloader.extended_fuses=0xFE
attiny85_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny85_diy.menu.boot.none=No (ISP Programmer Upload)
attiny85_diy.menu.boot.none.upload.maximum_size=8192
attiny85_diy.menu.boot.none.bootloader.tool=diy_attiny:avrdude_nobootloader

# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny85_diy.menu.clock.8MHz=8MHz Internal Oscillator
attiny85_diy.menu.clock.8MHz.build.f_cpu=8000000L
attiny85_diy.menu.clock.8MHz.bootloader.low_fuses=0xE2

attiny85_diy.menu.clock.16MHz=16MHz Crystal/Resonator
attiny85_diy.menu.clock.16MHz.build.f_cpu=16000000L
attiny85_diy.menu.clock.16MHz.bootloader.low_fuses=0xFF

attiny85_diy.menu.clock.1MHz=1MHz Internal Oscillator
attiny85_diy.menu.clock.1MHz.build.f_cpu=1000000L
attiny85_diy.menu.clock.1MHz.bootloader.low_fuses=0x62
attiny85_diy.menu.clock.1MHz.upload.speed=9600

# Core Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny85_diy.menu.core.FullCore=Millis and Tone Available
attiny85_diy.menu.core.FullCore.build.variant=tinyX5
attiny85_diy.menu.core.FullCore.build.core=tiny
attiny85_diy.menu.core.FullCore.build.extra_flags=

attiny85_diy.menu.core.SmallerCore=Millis Available, No Tone
attiny85_diy.menu.core.SmallerCore.build.variant=tinyX5
attiny85_diy.menu.core.SmallerCore.build.core=tiny
attiny85_diy.menu.core.SmallerCore.build.extra_flags=-DNO_TONE

attiny85_diy.menu.core.SmallestCore=No Millis, No Tone
attiny85_diy.menu.core.SmallestCore.build.variant=tinyX5
attiny85_diy.menu.core.SmallestCore.build.core=tiny
attiny85_diy.menu.core.SmallestCore.build.extra_flags=-DNO_MILLIS -DNO_TONE

# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny85_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny85_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

attiny85_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny85_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny85_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny85_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny85_diy.menu.print.Dec=Dec Only Supported
attiny85_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny85_diy.menu.print.Hex=Hex Only Supported
attiny85_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny85_diy.menu.print.Oct=Oct Only Supported
attiny85_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny85_diy.menu.print.Bin=Bin Only Supported (Smallest)
attiny85_diy.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN


# Millis Accuracy
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny85_diy.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny85_diy.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

attiny85_diy.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny85_diy.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny85_diy.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny85_diy.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny85_diy.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny85_diy.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

attiny85_diy.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny85_diy.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

attiny85_diy.menu.millis_ppm.2p5=Better Or Equal 2.5% Error
attiny85_diy.menu.millis_ppm.2p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=25000UL

attiny85_diy.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny85_diy.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny85_diy.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny85_diy.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny85_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny85_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny85_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny85_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny85_diy.menu.lto.enable=Enabled
attiny85_diy.menu.lto.enable.ltocflags=-flto -fno-fat-lto-objects
attiny85_diy.menu.lto.enable.ltoelfflags=-flto -fuse-linker-plugin
attiny85_diy.menu.lto.enable.ltocppflags=-flto
attiny85_diy.menu.lto.enable.ltoarcmd=gcc-
attiny85_diy.menu.lto.disable=Disabled
attiny85_diy.menu.lto.disable.ltocflags=
attiny85_diy.menu.lto.disable.ltoelfflags=
attiny85_diy.menu.lto.disable.ltocppflags=
attiny85_diy.menu.lto.disable.ltoarcmd=



# }}}

























################################################################################
# ATtiny24/A, ATtiny44/A, ATtiny84/A
#
# Note, there is no bootloader section, so we can not do any locking.
#
# Lock Bits Note
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  avrdude DOES NOT mask the lock bits on the x4, therefore
#
#    0xFF = No Locking
#    0xFE = Read Locking
#    0xFC = Read and Write Locking
#
# Extended Fuses Note
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  avrdude DOES NOT mask the extended fuses on the x4, the engbedded.com 
#  calulator's suggestion for alternative efuse settings is incorrect.
#
#
################################################################################

# {{{ ############### ATtiny24 #################################################

