sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
# {{{ ############### ATtiny13 #################################################

attiny13_diy.name=ATtiny13
attiny13_diy.build.mcu=attiny13
attiny13_diy.bootloader.low_fuses=0x7A
attiny13_diy.bootloader.high_fuses=0xFB
attiny13_diy.bootloader.unlock_bits=0x3F
attiny13_diy.bootloader.lock_bits=0x3F
attiny13_diy.build.f_cpu=9600000L
attiny13_diy.upload.speed=57600
attiny13_diy.build.core=tiny
attiny13_diy.build.variant=tiny13
attiny13_diy.build.board=ATTINY13_DIY
attiny13_diy.upload.tool=diy_attiny:avrdude_noefuse
attiny13_diy.program.tool=diy_attiny:avrdude_nobootloader_noefuse
attiny13_diy.bootloader.tool=diy_attiny:avrdude_nobootloader_noefuse
attiny13_diy.upload.maximum_data_size=64

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny13_diy.menu.version.attiny13 = ATtiny13
attiny13_diy.menu.version.attiny13.build.mcu = attiny13

attiny13_diy.menu.version.attiny13a = ATtiny13a
attiny13_diy.menu.version.attiny13a.build.mcu  = attiny13

# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Sorry attiny13, you're too small for bootloaders.
#
# attiny13_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
# attiny13_diy.menu.boot.optiboot.upload.protocol=arduino
# attiny13_diy.menu.boot.optiboot.upload.maximum_size=457
# attiny13_diy.menu.boot.optiboot.bootloader.extended_fuses=0xEB
# attiny13_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny13_diy.menu.boot.none=No (ISP Programmer Upload)
attiny13_diy.menu.boot.none.upload.maximum_size=1024
attiny13_diy.menu.boot.none.bootloader.tool=diy_attiny:avrdude_nobootloader_noefuse

# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny13_diy.menu.clock.9_6MHz=9.6MHz Internal Oscillator
attiny13_diy.menu.clock.9_6MHz.build.f_cpu=9600000L
attiny13_diy.menu.clock.9_6MHz.bootloader.low_fuses=0x7A

attiny13_diy.menu.clock.4_8MHz=4.8MHz Internal Oscillator
attiny13_diy.menu.clock.4_8MHz.build.f_cpu=4800000L
attiny13_diy.menu.clock.4_8MHz.bootloader.low_fuses=0x79

attiny13_diy.menu.clock.1_2MHz=1.2MHz Internal Oscillator
attiny13_diy.menu.clock.1_2MHz.build.f_cpu=1200000L
attiny13_diy.menu.clock.1_2MHz.bootloader.low_fuses=0x62


# Core Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

attiny13_diy.menu.core.MillisCore=Millis Available, No Tone
attiny13_diy.menu.core.MillisCore.build.variant=tiny13
attiny13_diy.menu.core.MillisCore.build.core=tiny
attiny13_diy.menu.core.MillisCore.build.extra_flags=-DNO_TONE

attiny13_diy.menu.core.ToneCore=Tone Available, No Millis
attiny13_diy.menu.core.ToneCore.build.variant=tiny13
attiny13_diy.menu.core.ToneCore.build.core=tiny
attiny13_diy.menu.core.ToneCore.build.extra_flags=-DNO_MILLIS

attiny13_diy.menu.core.SmallestCore=No Millis, No Tone
attiny13_diy.menu.core.SmallestCore.build.variant=tiny13
attiny13_diy.menu.core.SmallestCore.build.core=tiny
attiny13_diy.menu.core.SmallestCore.build.extra_flags=-DNO_MILLIS -DNO_TONE

attiny13_diy.menu.core.FullCore=Millis and Tone Available
attiny13_diy.menu.core.FullCore.build.variant=tiny13
attiny13_diy.menu.core.FullCore.build.core=tiny
attiny13_diy.menu.core.FullCore.build.extra_flags=


# Millis Accuracy
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13_diy.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny13_diy.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

attiny13_diy.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny13_diy.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny13_diy.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny13_diy.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny13_diy.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny13_diy.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

attiny13_diy.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny13_diy.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

attiny13_diy.menu.millis_ppm.2p5=Better Or Equal 2.5% Error
attiny13_diy.menu.millis_ppm.2p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=25000UL

attiny13_diy.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny13_diy.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny13_diy.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny13_diy.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny13_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny13_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny13_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny13_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL






# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny13_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

attiny13_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny13_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny13_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny13_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny13_diy.menu.print.Dec=Dec Only Supported
attiny13_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny13_diy.menu.print.Hex=Hex Only Supported
attiny13_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

