sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
attiny13_diy.menu.print.Oct=Oct Only Supported
attiny13_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny13_diy.menu.print.Bin=Bin Only Supported (Smallest)
attiny13_diy.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

# Serial Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13_diy.menu.serial.HalfDuplexRW=Half Duplex, Read+Write
attiny13_diy.menu.serial.HalfDuplexRW.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX

attiny13_diy.menu.serial.HalfDuplexRWStream=Half Duplex, Read+Write Inherits Stream
attiny13_diy.menu.serial.HalfDuplexRWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny13_diy.menu.serial.HalfDuplexRStream=Half Duplex, Read Only Inherits Stream
attiny13_diy.menu.serial.HalfDuplexRStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_WRITE -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny13_diy.menu.serial.HalfDuplexWStream=Half Duplex, Write Only Inherits Stream
attiny13_diy.menu.serial.HalfDuplexWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_READ

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny13_diy.menu.lto.enable=Enabled
attiny13_diy.menu.lto.enable.ltocflags=-flto -fno-fat-lto-objects
attiny13_diy.menu.lto.enable.ltoelfflags=-flto -fuse-linker-plugin
attiny13_diy.menu.lto.enable.ltocppflags=-flto
attiny13_diy.menu.lto.enable.ltoarcmd=gcc-
attiny13_diy.menu.lto.disable=Disabled
attiny13_diy.menu.lto.disable.ltocflags=
attiny13_diy.menu.lto.disable.ltoelfflags=
attiny13_diy.menu.lto.disable.ltocppflags=
attiny13_diy.menu.lto.disable.ltoarcmd=



# }}}





################################################################################
# ATtiny4
#
# There is only 1 fuse on this series of chips, it really doesn't do much.
#
# Fuse
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  See page 154 of Datasheet
#
#   avrdude DOES NOT mask the fuse bits
#
#   0xFF = Default (Reset Enabled, WDT Not Always On, Clock Not Output)
#
# Lock Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  See page 153 of Datasheet
#
#  avrdude DOES NOT mask the lock bits
#
#    0xFF = No Locking
#    0xFE = Write Locked
#    0xFC = Read and Write Locked
#
# Important: Lock bits must be set after setting the fuse.
#
################################################################################

# {{{ ############### ATtiny4 ##################################################

attiny4_diy.name=ATtiny4
attiny4_diy.build.mcu=attiny4
attiny4_diy.bootloader.fuse=0xFF
attiny4_diy.bootloader.unlock_bits=0xFF
attiny4_diy.bootloader.lock_bits=0xFF
attiny4_diy.build.f_cpu=8000000L
attiny4_diy.upload.speed=57600
attiny4_diy.build.core=tiny
attiny4_diy.build.variant=tiny4_9
attiny4_diy.build.board=ATTINY4_DIY
attiny4_diy.upload.tool=diy_attiny:avrdude_nobootloader_onefuse
attiny4_diy.bootloader.tool=diy_attiny:avrdude_nobootloader_onefuse
attiny4_diy.upload.maximum_data_size=32

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Only one version, no sense including this menu
# attiny4_diy.menu.version.attiny4 = ATtiny4
# attiny4_diy.menu.version.attiny4.build.mcu = attiny4

# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# The frequency on the Reduced Core tinyAVR is set at runtime by way of a 
# prescaler (power of 2) on the internal 8MHz oscillator.
#
# See pins_arduino.h setCPUFrequency()

attiny4_diy.menu.clock.8MHz=8MHz
attiny4_diy.menu.clock.8MHz.build.f_cpu=8000000L

attiny4_diy.menu.clock.4MHz=4MHz
attiny4_diy.menu.clock.4MHz.build.f_cpu=4000000L

attiny4_diy.menu.clock.2MHz=2MHz
attiny4_diy.menu.clock.2MHz.build.f_cpu=2000000L

attiny4_diy.menu.clock.1MHz=1MHz
attiny4_diy.menu.clock.1MHz.build.f_cpu=1000000L

# These frequencies under 1MHz need some work
#  something is wrong with delayMicroSecondsAdjusted, running too fast
#  could be a memory issue maybe.

# attiny4_diy.menu.clock.500kHz=500kHz
# attiny4_diy.menu.clock.500kHz.build.f_cpu=500000L

# attiny4_diy.menu.clock.250kHz=250kHz
# attiny4_diy.menu.clock.250kHz.build.f_cpu=250000L

# attiny4_diy.menu.clock.125kHz=125kHz
# attiny4_diy.menu.clock.125kHz.build.f_cpu=125000L


# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# Sorry attiny4, you're too small for bootloaders.
#
# attiny4_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
# attiny4_diy.menu.boot.optiboot.upload.protocol=arduino
# attiny4_diy.menu.boot.optiboot.upload.maximum_size=457
# attiny4_diy.menu.boot.optiboot.bootloader.extended_fuses=0xEB
# attiny4_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

attiny4_diy.menu.boot.none=No (TPI Programmer Upload)
attiny4_diy.menu.boot.none.upload.maximum_size=512
attiny4_diy.menu.boot.none.bootloader.tool=diy_attiny:avrdude_nobootloader_onefuse

# Core Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#attiny4_diy.menu.core.FullCore=Millis and Tone Available
#attiny4_diy.menu.core.FullCore.build.core=tiny
#attiny4_diy.menu.core.FullCore.build.extra_flags=

# tone() is not supported on tiny4
attiny4_diy.menu.core.SmallerCore=Millis Available, No Tone
attiny4_diy.menu.core.SmallerCore.build.core=tiny
attiny4_diy.menu.core.SmallerCore.build.extra_flags=-DNO_TONE

attiny4_diy.menu.core.SmallestCore=No Millis, No Tone
attiny4_diy.menu.core.SmallestCore.build.core=tiny
attiny4_diy.menu.core.SmallestCore.build.extra_flags=-DNO_MILLIS -DNO_TONE

# Millis Accuracy
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny4_diy.menu.millis_ppm.1p6=Better Or Equal 1.666% Error (Default)
attiny4_diy.menu.millis_ppm.1p6.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=16666UL

