sleemanj/optiboot/dists/diy_attiny/avr/boards.txt
attiny4_diy.menu.millis_ppm.50p=Better Or Equal 50% Error (Lowest Code Use)
attiny4_diy.menu.millis_ppm.50p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=500000UL

attiny4_diy.menu.millis_ppm.25p=Better Or Equal 25% Error
attiny4_diy.menu.millis_ppm.25p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=250000UL

attiny4_diy.menu.millis_ppm.10p=Better Or Equal 10% Error
attiny4_diy.menu.millis_ppm.10p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=100000UL

attiny4_diy.menu.millis_ppm.5p=Better Or Equal 5% Error
attiny4_diy.menu.millis_ppm.5p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=50000UL

attiny4_diy.menu.millis_ppm.2p5=Better Or Equal 2.5% Error
attiny4_diy.menu.millis_ppm.2p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=25000UL

attiny4_diy.menu.millis_ppm.1p=Better Or Equal 1% Error
attiny4_diy.menu.millis_ppm.1p.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=10000UL

attiny4_diy.menu.millis_ppm.0p5=Better Or Equal 0.5% Error
attiny4_diy.menu.millis_ppm.0p5.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=5000UL

attiny4_diy.menu.millis_ppm.0p25=Better Or Equal 0.25% Error
attiny4_diy.menu.millis_ppm.0p25.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=2500UL

attiny4_diy.menu.millis_ppm.0p1=Better Or Equal 0.1% Error (Highest Code Use)
attiny4_diy.menu.millis_ppm.0p1.build.custom_flags.millis_ppm=-DACCEPTABLE_MILLIS_ERROR_PPM=1000UL


# Print Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny4_diy.menu.print.default=Bin Only Supported (Smallest)
attiny4_diy.menu.print.default.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

attiny4_diy.menu.print.Arbitrary=Full Support For Arbitrary Bases (Biggest)
attiny4_diy.menu.print.Arbitrary.build.custom_flags.print.use_base=-DPRINT_USE_BASE_ARBITRARY

attiny4_diy.menu.print.BinHexDecOct=Bin, Hex, Dec, Oct Supported
attiny4_diy.menu.print.BinHexDecOct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX -DPRINT_USE_BASE_OCT

attiny4_diy.menu.print.BinHexDec=Bin, Hex, Dec Supported
attiny4_diy.menu.print.BinHexDec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN -DPRINT_USE_BASE_DEC -DPRINT_USE_BASE_HEX

attiny4_diy.menu.print.Dec=Dec Only Supported
attiny4_diy.menu.print.Dec.build.custom_flags.print.use_base=-DPRINT_USE_BASE_DEC

attiny4_diy.menu.print.Hex=Hex Only Supported
attiny4_diy.menu.print.Hex.build.custom_flags.print.use_base=-DPRINT_USE_BASE_HEX

attiny4_diy.menu.print.Oct=Oct Only Supported
attiny4_diy.menu.print.Oct.build.custom_flags.print.use_base=-DPRINT_USE_BASE_OCT

attiny4_diy.menu.print.Bin=Bin Only Supported (Smallest)
attiny4_diy.menu.print.Bin.build.custom_flags.print.use_base=-DPRINT_USE_BASE_BIN

# Serial Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny4_diy.menu.serial.HalfDuplexRW=Half Duplex, Read+Write
attiny4_diy.menu.serial.HalfDuplexRW.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX

attiny4_diy.menu.serial.HalfDuplexRWStream=Half Duplex, Read+Write Inherits Stream
attiny4_diy.menu.serial.HalfDuplexRWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny4_diy.menu.serial.HalfDuplexRStream=Half Duplex, Read Only Inherits Stream
attiny4_diy.menu.serial.HalfDuplexRStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_WRITE -DHALFDUPLEXSERIAL_INHERIT_FROM=Stream

attiny4_diy.menu.serial.HalfDuplexWStream=Half Duplex, Write Only Inherits Stream
attiny4_diy.menu.serial.HalfDuplexWStream.build.custom_flags.serial.use_serial_type=-DUSE_SERIAL_TYPE=SERIAL_TYPE_HALF_DUPLEX -DHALF_DUPLEX_SERIAL_DISABLE_READ

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
attiny4_diy.menu.lto.enable=Enabled
attiny4_diy.menu.lto.enable.ltocflags=-flto -fno-fat-lto-objects
attiny4_diy.menu.lto.enable.ltoelfflags=-flto -fuse-linker-plugin
attiny4_diy.menu.lto.enable.ltocppflags=-flto
attiny4_diy.menu.lto.enable.ltoarcmd=gcc-
attiny4_diy.menu.lto.disable=Disabled
attiny4_diy.menu.lto.disable.ltocflags=
attiny4_diy.menu.lto.disable.ltoelfflags=
attiny4_diy.menu.lto.disable.ltocppflags=
attiny4_diy.menu.lto.disable.ltoarcmd=



# }}}



################################################################################
# ATtiny9
#
# There is only 1 fuse on this series of chips, it really doesn't do much.
#
# Fuse
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  See page 154 of Datasheet
#
#   avrdude DOES NOT mask the fuse bits
#
#   0xFF = Default (Reset Enabled, WDT Not Always On, Clock Not Output)
#
# Lock Bits
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
#  See page 153 of Datasheet
#
#  avrdude DOES NOT mask the lock bits
#
#    0xFF = No Locking
#    0xFE = Write Locked
#    0xFC = Read and Write Locked
#
# Important: Lock bits must be set after setting the fuse.
#
################################################################################

# {{{ ############### ATtiny9 #################################################

attiny9_diy.name=ATtiny9
attiny9_diy.build.mcu=attiny9
attiny9_diy.bootloader.fuse=0xFF
attiny9_diy.bootloader.unlock_bits=0xFF
attiny9_diy.bootloader.lock_bits=0xFF
attiny9_diy.build.f_cpu=8000000L
attiny9_diy.upload.speed=57600
attiny9_diy.build.core=tiny
attiny9_diy.build.variant=tiny4_9
attiny9_diy.build.board=ATTINY9_DIY
attiny9_diy.upload.tool=diy_attiny:avrdude_nobootloader_onefuse
attiny9_diy.bootloader.tool=diy_attiny:avrdude_nobootloader_onefuse
attiny9_diy.upload.maximum_data_size=32

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Only one version, no sense including this menu
# attiny9_diy.menu.version.attiny9 = ATtiny9
# attiny9_diy.menu.version.attiny9.build.mcu = attiny9

# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# The frequency on the Reduced Core tinyAVR is set at runtime by way of a 
# prescaler (power of 2) on the internal 8MHz oscillator.
#
# See pins_arduino.h setCPUFrequency()

attiny9_diy.menu.clock.8MHz=8MHz
attiny9_diy.menu.clock.8MHz.build.f_cpu=8000000L

attiny9_diy.menu.clock.4MHz=4MHz
attiny9_diy.menu.clock.4MHz.build.f_cpu=4000000L

attiny9_diy.menu.clock.2MHz=2MHz
attiny9_diy.menu.clock.2MHz.build.f_cpu=2000000L

attiny9_diy.menu.clock.1MHz=1MHz
attiny9_diy.menu.clock.1MHz.build.f_cpu=1000000L

# These frequencies under 1MHz need some work
#  something is wrong with delayMicroSecondsAdjusted, running too fast
#  could be a memory issue maybe.

# attiny9_diy.menu.clock.500kHz=500kHz
# attiny9_diy.menu.clock.500kHz.build.f_cpu=500000L

# attiny9_diy.menu.clock.250kHz=250kHz
# attiny9_diy.menu.clock.250kHz.build.f_cpu=250000L

